#include<iostream>
#include <windows.h>
#include<string>
#include<iomanip>
#include<vector>
#include<algorithm>
#include "Header.h"
using namespace std;
void Show(Student a)
{
	cout << "Id = " << a.id << endl; cout << "ФИО = " << a.fio << endl;
	cout << "Год р-я = " << a.god << endl; cout << "Пол = " << a.pol << endl;
	cout << "Вес  = " << a.ves << endl; cout << "Рост = " << a.rost << endl;
	cout << "Стипендия = " << a.stependia << endl; 	cout << "Группа = "
		<< a.gruppa << endl; cout << "Телефон = " << a.tel << endl;

	cout << endl;
	for (int i = 0; i < 3; i++)
	{
		for (int j = 0; j < 6; j++)
		{
			cout << left << setw(16) << a.predmeti[i][j];
		}
		cout << endl;
	} 
	cout << endl;
	for (int i = 0; i < sizeof(a.marks) / sizeof(a.marks[0]); i++)
	{
		cout << a.marks[i] << "\t";
	}
	cout << endl;
}
bool Age(Student a, Student b)
{
	if (a.god < b.god)
	{
		return 1;
	}
	else
	{
		return 0;
	}
}
bool Ves(Student a, Student b)
{
	if (a.ves < b.ves)
	{
		return 1;
	}
	else
	{
		return 0;
	}
}
bool Rost(Student a, Student b)
{
	if (a.rost < b.rost)
	{
		return 1;
	}
	else
	{
		return 0;
	}
}
int Adult(Student a)
{
	if (2024 - a.god >= 18)
	{
		cout << "Совершеннолетний(яя)";
	}
	else
	{
		cout << "Несовершеннолетний(яя)";
	}
	return 0;
}
	
		
void Print(vector<Student>& v)
{
	cout << "  ID " << "|" << "         ФИО          " << "|" <<"Пол"<<"|"<<"Вес"<<"|" <<"Рост"<<"|"<<"  Группа "<<" | "<< "Год р - я" << " | " <<"     Сов / Несов    " <<" | "<<endl;
	cout << "_____" << "|" << "______________________" << "|" << "___" <<"|"<<"___"<< "|"<<"____"<<"|"<<"__________"<<"|" << "___________"<<"|"<<"______________________"<<"|"<<endl;
	for (int i = 0; i < v.size(); i++)
	{
		if ((2024 - v[i].god) >= 18)
		{
			cout << left << setw(4) << v[i].id << " |  " << setw(20) << left << v[i].fio << "|" << left << setw(3) << v[i].pol << "|" <<left<<setw(3)<<v[i].ves<<"|"<<left<<setw(1)<<v[i].rost<<"|"<< left << setw(10) << v[i].gruppa << "|" << right << setw(8) << v[i].god << "   |" << left << setw(2) << Adult(v[i]) << "|" << endl;
		}
		else
		{
			cout << left << setw(4) << v[i].id << " |  " << setw(20) << left << v[i].fio << "|" << left << setw(3) << v[i].pol << "|" << left << setw(3) << v[i].ves << "|" << left << setw(1) << v[i].rost << "|" << left << setw(10) << v[i].gruppa << "|" << right << setw(8) << v[i].god << "   |" << left << setw(2) << Adult(v[i]) << "|" << endl;
		}
	}
	cout << "_____" << "|" << "______________________" << "|" << "___" << "|" << "___" << "|" << "____" << "|" << "__________" << "|" << "___________" << "|" << "______________________" << "|" << endl;
}
bool ID(Student a, Student b)
{
	if (a.id < b.id)
	{
		return 1;
	}
	else
	{
		return 0;
	}
}
int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	Student Ivan{ 1, "Румянцев Тимофей", 2007, 'М', 65, 1.77, 900, "2ОИБАС1122", 89681240254,
	{{"Предметы:  ", "История","Химия", "Физика",	 "ОАиП", "Физ-ра"},
	{"Преподаватели: ", "Титов", "Иванов", "Петров", "Смирнов", "Мохначев"},
	{"Оценки ", "4", "5", "4", "4","3"} }, {2,3,5,2,5 } };
	Student Fedor{ 2, "Петров Фёдор", 2006, 'М', 69, 1.68, 1200, "2ОИБАС1222", 89681240260 ,
	{{"Предметы:  ", "История","Химия", "Физика",	 "ОАиП", "Физ-ра"},
	{"Преподаватели: ", "Титов", "Иванов", "Петров", "Смирнов", "Мохначев"},
	{"Оценки ", "4", "5", "4", "4","3"}, },{3,3,4,2,2 } };
	Student Anna{ 3, "Иванова Анна", 2005, 'Ж',  58, 1.59, 900, "2ОИБАС1022", 89681025466 ,
	{{"Предметы:  ", "История","Химия", "Физика",	 "ОАиП", "Физ-ра"},
	{"Преподаватели: ", "Титов", "Иванов", "Петров", "Смирнов", "Мохначев"},
	{"Оценки ", "4", "5", "4", "4","3"}, },{4,3,5,4,5 } };
	Student Lena{ 4, "Смирнова Лена", 2007, 'Ж', 59, 1.61, 1200, "2ОИБАС922", 89654240254 ,
	{{"Предметы:  ", "История","Химия", "Физика",	 "ОАиП", "Физ-ра"},
	{"Преподаватели: ", "Титов", "Иванов", "Петров", "Смирнов", "Мохначев"},
	{"Оценки ", "4", "5", "4", "4","3"}, },{2,3,5,2,5 } };
	Student Peter{ 5, "Радионов Радион", 2006, 'М',  66, 1.71, 0, "2ОИБАС1122", 89681269254 ,
	{{"Предметы:  ", "История","Химия", "Физика",	 "ОАиП", "Физ-ра"},
	{"Преподаватели: ", "Титов", "Иванов", "Петров", "Смирнов", "Мохначев"},
	{"Оценки ", "4", "5", "4", "4","3"}, },{2,3,5,2,5 } };
	Student Aleksey{ 6, "Николаев Алексей", 2005, 'М', 68, 1.72, 1200, "2ОИБАС1222", 89681240125 ,
	{{"Предметы:  ", "История","Химия", "Физика",	 "ОАиП", "Физ-ра"},
	{"Преподаватели: ", "Титов", "Иванов", "Петров", "Смирнов", "Мохначев"},
	{"Оценки ", "4", "5", "4", "4","3"}, },{2,3,4,2,4 } };
	Student Nikolay{ 7, "Колюх Николай", 2006, 'М', 71, 1.66, 900, "2ОИБАС1122", 89681241850 ,
	{{"Предметы:  ", "История","Химия", "Физика",	 "ОАиП", "Физ-ра"},
	{"Преподаватели: ", "Титов", "Иванов", "Петров", "Смирнов", "Мохначев"},
	{"Оценки ", "4", "5", "4", "4","3"}, },{2,3,5,2,5 } };
	Student Timur{ 8, "Гайдар Тимур", 2007, 'М', 70, 1.65, 1200, "2ОИБАС1022", 89681236897 ,
	{{"Предметы:  ", "История","Химия", "Физика",	 "ОАиП", "Физ-ра"},
	{"Преподаватели: ", "Титов", "Иванов", "Петров", "Смирнов", "Мохначев"},
	{"Оценки ", "4", "5", "4", "4","3"}, },{4,4,5,2,5 } };
	Student Asya{ 9, "Белова Ася", 2005, 'Ж', 52, 1.78, 0, "2ОИБАС1322", 89691253678 ,
	{{"Предметы:  ", "История","Химия", "Физика",	 "ОАиП", "Физ-ра"},
	{"Преподаватели: ", "Титов", "Иванов", "Петров", "Смирнов", "Мохначев"},
	{"Оценки ", "4", "5", "4", "4","3"}, },{2,3,5,2,2 } };
	Student Sonya{ 10, "Громова Соня", 2006, 'Ж', 53, 1.75, 900, "2ОИБАС922", 8691234568 ,
	{{"Предметы:  ", "История","Химия", "Физика",	 "ОАиП", "Физ-ра"},
	{"Преподаватели: ", "Титов", "Иванов", "Петров", "Смирнов", "Мохначев"},
	{"Оценки ", "4", "5", "4", "4","3"}, },{5,5,5,5,5 } };
	vector<Student> vect;
	vect.push_back(Ivan);
	vect.push_back(Fedor);
	vect.push_back(Anna);
	vect.push_back(Lena);
	vect.push_back(Peter);
	vect.push_back(Aleksey);
	vect.push_back(Nikolay);
	vect.push_back(Timur);
	vect.push_back(Asya);
	vect.push_back(Sonya);
	cout << "До сортировки: " << endl;
	Print(vect);
	Show(Ivan);
	Show(Fedor);
	Show(Anna);
	Show(Lena);
	Show(Peter);
	Show(Aleksey);
	Show(Nikolay);
	Show(Timur);
	Show(Asya);
	Show(Sonya);
	cout << endl << "После сортировки года рождения: " << endl;
	sort(vect.begin(), vect.end(), Age);
	Print(vect);
	cout << endl << "После сортировки веса: " << endl;
	sort(vect.begin(), vect.end(), Ves);
	Print(vect);
	cout <<endl<< "После сортировки роста: " << endl;
	sort(vect.begin(), vect.end(), Rost);
	Print(vect);
}

